class CreateAdMockJson {
  static final Map<String, dynamic> fetchTagsResponse = {
    "rent_type": [
      {
        "id": 1,
        "title": "Ваша цель",
        "tags": [
          {"id": 1, "title": "Аренда"},
          {"id": 2, "title": "Обмен"},
        ],
      },
      {
        "id": 2,
        "title": "Срок",
        "tags": [
          {"id": 3, "title": "Долгосрочная"},
          {"id": 4, "title": "Посуточно"},
        ],
      },
      {
        "id": 3,
        "title": "Кому готов сдавать",
        "tags": [
          {"id": 10, "title": "Одному человеку"},
          {"id": 11, "title": "Компании"},
          {"id": 12, "title": "Семье"},
          {"id": 13, "title": "Студентам"},
        ],
      },
    ],
    "premises_type": [
      {
        "id": 4,
        "title": "Тип помещения",
        "tags": [
          {"id": 20, "title": "Жилое"},
          {"id": 21, "title": "Коммерческое"},
        ],
      },
    ],
    "property_type": [
      {
        "id": 5,
        "title": "Вид недвижимости",
        "tags": [
          {"id": 30, "title": "Квартира"},
          {"id": 31, "title": "Апартаменты"},
          {"id": 32, "title": "Комната"},
          {"id": 33, "title": "Койко-место"},
          {"id": 34, "title": "Дом"},
          {"id": 35, "title": "Коттедж"},
          {"id": 36, "title": "Таунхаус"},
        ],
      },
    ],
    "apartment_properties": [
      {
        "id": 6,
        "title": "Количество комнат",
        "tags": [
          {"id": 40, "title": "Студия"},
          {"id": 41, "title": "1"},
          {"id": 42, "title": "2"},
          {"id": 43, "title": "3"},
          {"id": 44, "title": "4"},
          {"id": 45, "title": "5"},
          {"id": 46, "title": "6+"},
          {"id": 47, "title": "Свободная планировка"},
        ],
      },
      {
        "id": 7,
        "title": "Планировка",
        "tags": [
          {"id": 50, "title": "Смежная"},
          {"id": 51, "title": "Изолированная"},
          {"id": 52, "title": "Смежно-изолированная"},
        ],
      },
    ],
    "features": [
      {
        "id": 8,
        "title": "Ремонт",
        "tags": [
          {"id": 60, "title": "Без ремонта"},
          {"id": 61, "title": "Евро"},
          {"id": 62, "title": "Косметический"},
        ],
      },
      {
        "id": 9,
        "title": "Лифты",
        "tags": [
          {"id": 70, "title": "Пассажирский"},
          {"id": 71, "title": "Грузовой"},
          {"id": 72, "title": "Пассажирский и грузовой"},
        ],
      },
      {
        "id": 10,
        "title": "Балконы",
        "tags": [
          {"id": 80, "title": "Балкон"},
          {"id": 81, "title": "Нет"},
          {"id": 82, "title": "Лоджия"},
          {"id": 83, "title": "Балкон и лоджия"},
          {"id": 84, "title": "Терраса"},
        ],
      },
    ],
    "things": [
      {
        "id": 11,
        "title": "Мебель",
        "tags": [
          {"id": 90, "title": "Есть"},
          {"id": 91, "title": "Нет"},
          {"id": 92, "title": "Частично"},
        ],
      },
      {
        "id": 12,
        "title": "Удобства",
        "tags": [
          {"id": 100, "title": "Интернет"},
          {"id": 101, "title": "Мусоропровод"},
          {"id": 102, "title": "Посуда"},
          {"id": 103, "title": "Видеодомофон"},
          {"id": 104, "title": "Консьерж"},
          {"id": 105, "title": "Умный дом"},
        ],
      },
      {
        "id": 13,
        "title": "Ванная комната",
        "tags": [
          {"id": 110, "title": "Душевая кабина"},
          {"id": 111, "title": "Ванна"},
        ],
      },
      {
        "id": 14,
        "title": "Бытовая техника",
        "tags": [
          {"id": 120, "title": "Холодильник"},
          {"id": 121, "title": "Телевизор"},
          {"id": 122, "title": "Стиральная машина"},
          {"id": 123, "title": "Кондиционер"},
          {"id": 124, "title": "Посудомоечная машина"},
        ],
      },
      {
        "id": 15,
        "title": "Плита",
        "tags": [
          {"id": 130, "title": "Газ"},
          {"id": 131, "title": "Электрическая"},
        ],
      },
    ],
    "deal_terms": [
      {
        "id": 16,
        "title": "Цена",
        "tags": [
          {"id": 140, "title": "Рубли"},
          {"id": 141, "title": "Евро"},
          {"id": 142, "title": "Доллары"},
        ],
      },
      {
        "id": 17,
        "title": "Предоплата",
        "tags": [
          {"id": 150, "title": "Без предоплаты"},
          {"id": 151, "title": "Месяц"},
          {"id": 152, "title": "2"},
          {"id": 153, "title": "3"},
          {"id": 154, "title": "4+"},
        ],
      },
      {
        "id": 18,
        "title": "Срок аренды",
        "tags": [
          {"id": 160, "title": "Несколько месяцев"},
          {"id": 161, "title": "От года"},
        ],
      },
      {
        "id": 19,
        "title": "Условия сдачи",
        "tags": [
          {"id": 170, "title": "Можно с детьми"},
          {"id": 171, "title": "Можно с животными"},
        ],
      },
    ],
    "contact_info": [
      {
        "id": 20,
        "title": "Способ связи",
        "tags": [
          {"id": 180, "title": "Оба способа"},
          {"id": 181, "title": "Звонки"},
          {"id": 182, "title": "Сообщения"},
        ],
      },
    ],
  };
}
